Repository: Baglan-maker/Diary-project
Catalog: lib/l10n/app_*.arb
Languages: kk

# greeting
source: Hello, Dreamer ✨ Here are your recent diary entries:
kk: Сәлем, Армандаушы ✨ Күнделіктегі соңғы жазбаларыңыз:

# greetingDrawer
source: Hello, Dreamer ✨
kk: Сәлем, Армандаушы ✨

source: Delete Entry
kk: Жазбаны жою

# confirmDelete
source: Are you sure you want to delete this entry?
kk: Бұл жазбаны жойғыңыз келетініне сенімдісіз бе?

source: Cancel
kk: Бас тарту

source: Delete
kk: Жою

# newEntryNote
source: This is a brand-new diary entry!
kk: Бұл күнделікке жаңа жазба!

# newEntryTitle
source: New Day {index}
kk: Жаңа күн {index}

# dayTitle
source: Day {index}
kk: {index}-күн

# dayNote
source: Today I felt really inspired to write something personal...
kk: Бүгін мен бір нәрсе жазғым келіп, шабыт алдым...

source: Home
kk: Үй

source: Settings
kk: Параметрлер

source: About
kk: Қосымша туралы

source: Dark Mode
kk: Қараңғы Режим

source: Change Language
kk: Тілді Өзгерту

source: Coming soon!
kk: Жақында шығады!

# aboutAppTitle
source: Personal Diary - Your Daily Journal
kk: Жеке күнделік - Сіздің күнделікті журналыңыз

# aboutAppDescription
source: This app allows you to record your daily thoughts, track your mood, and organize your personal notes securely.
kk: Бұл қосымша сіздің күнделікті ойларыңызды жазуға, көңіл-күйіңізді бақылауға және жеке жазбаларыңызды қауіпсіз ұйымдастыруға мүмкіндік береді.

# aboutAppDevelopers
source: Developed by: Dumanuli Darkhan, Keneskhan Magzhan, Tolegenov Baglan, Tuspekova Gulzhan
kk: Даму: Думанули Дархан, Кенесхан Магжан, Толегенов Баглан, Туспекова Гульжан

# aboutAppCourseInfo
source: In the scope of the course “Cross-platform mobile development” at Astana IT University.
kk: Астана Айти Университетіндегі «Кроссплатформалық мобильді даму» курсы аясында.

source: Login
kk: Кіру

# emailAlreadyInUse
source: Email is already in use
kk: Электрондық пошта бұрыннан тіркелген

# invalidEmail
source: Invalid email address
kk: Жарамсыз электрондық пошта мекенжайы

# weakPassword
source: Password is too weak
kk: Құпиясөз тым әлсіз

# registrationFailed
source: Registration failed. Please try again.
kk: Тіркелу сәтсіз аяқталды. Қайта көріңіз.

source: User not found
kk: Пайдаланушы табылмады

# wrongPassword
source: Incorrect password
kk: Құпиясөз қате

source: Login failed
kk: Кіру қатесі

# alreadyHaveAccount
source: Already have an account? Log in
kk: Аккаунтыңыз бар ма? Кіру

source: Guest
kk: Қонақ

source: Register
kk: Тіркелу

source: Email
kk: Эл. пошта

source: Password
kk: Құпия сөз

# noAccountRegister
source: Don't have an account? Register
kk: Аккаунтыңыз жоқ па? Тіркеліңіз

source: Logout
kk: Шығу

# pleaseLoginToAccess
source: Please log in to access this feature
kk: Осы мүмкіндікке қол жеткізу үшін жүйеге кіріңіз

# enterEmailPassword
source: Please enter email and password
kk: Электрондық пошта мен құпия сөзді енгізіңіз"
